cask_args appdir: '/Applications'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jamesramsay/extras"
brew "awscli"
brew "clipper", restart_service: true
brew "exa"
brew "exiftool"
brew "fd"
brew "webp"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "git-sizer"
brew "gnu-tar"
brew "gnupg"
brew "graphicsmagick"
brew "httpie"
brew "hugo"
brew "libheif"
brew "jpeginfo"
brew "jpegoptim"
brew "jq"
brew "magic-wormhole"
brew "mas"
brew "neovim", args: ["HEAD"]
brew "pinentry-mac"
brew "pngcheck"
brew "pngquant"
brew "proselint"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "s3cmd"
brew "shellcheck"
brew "tldr"
brew "tmux"
brew "zopfli"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "arq"
cask "audio-hijack"
cask "docker"
cask "dropbox"
cask "firefox"
cask "gitup"
cask "iina"
cask "imagealpha"
cask "imageoptim"
cask "karabiner-elements"
cask "launchbar"
cask "little-snitch"
cask "mailmate"
cask "monitorcontrol"
cask "netnewswire"
cask "proxyman"
cask "slack"
cask "soundsource"
cask "spotify"
cask "superduper"
cask "transmission"
cask "turbo-boost-switcher"
cask "webpquicklook"
cask "zoomus"
mas "Browser Fairy", id: 483014855
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "FruitJuice", id: 671736912
mas "iA Writer", id: 775737590
mas "Kaleidoscope", id: 587512244
mas "PCalc", id: 403504866
mas "Table Tool", id: 1122008420
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "WhatsApp", id: 1147396723
mas "AdGuard for Safari", id: 1440147259
mas "Lungo", id: 1263070803
