cask_args appdir: '/Applications'
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jamesramsay/extras"
brew "clipper", restart_service: true
brew "exiftool"
brew "fd"
brew "webp"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "git"
brew "httpie"
brew "hugo"
brew "libheif"
brew "jpeginfo"
brew "jpegoptim"
brew "jq"
brew "neovim"
brew "pngcheck"
brew "pngquant"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "zopfli"
brew "zsh"
cask "alacritty"
cask "arq"
cask "audio-hijack"
cask "docker"
cask "gitup"
cask "iina"
cask "imagealpha"
cask "imageoptim"
cask "karabiner-elements"
cask "little-snitch"
cask "mailmate"
cask "monitorcontrol"
cask "soundsource"
cask "spotify"
