cask_args appdir: '/Applications'

brew 'zsh'
brew 'fzf'

# Multiplexer
brew 'tmux'
brew 'reattach-to-user-namespace'     # fix MacOS usernamespace issue
brew 'clipper'                        # improved clipboard

# Editor
brew 'neovim/neovim/neovim'
# vim-plug

# git
brew 'git'
brew 'tig'

# node
# TODO: n version manager
brew 'node'
brew 'yarn'

# Utilities
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'jq'
brew 'magic-wormhole'                 # magic file transfers
brew 'pv'                             # pipe progress bars
brew 'rename'                         # bulk file renaming
brew 'watchman'                       # file watching, use for vim Command-T

# Unstable tools
brew 'jamesramsay/extras/clac'

